InformationRegisters/ПроизошедшиеБизнесСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПроизошедшиеБизнесСобытия</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыБизнесСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникБизнесСобытий</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтекстСобытия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУдалосьОбработать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧислоПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ра_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПроизошедшиеБизнесСобытия/Ext/ManagerModule.bsl
// Перезаписывает запись регистра, изменяя параметры Обработано или ЧислоПопытокОбработки или ПометкаУдаления
//  запись идентифицируется через Идентификатор
Процедура ОбновитьЗапись(Идентификатор, Обработано = Неопределено, ЧислоПопытокОбработки = Неопределено,
	ПометкаУдаления = Неопределено, СообщениеОбОшибке = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		
		ЗаписьУжеЕстьВБазе = Ложь;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПроизошедшиеБизнесСобытия");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Идентификатор", Идентификатор);
		Блокировка.Заблокировать();   		
		
		НаборЗаписей = РегистрыСведений.ПроизошедшиеБизнесСобытия.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор);
		
		СтруктураОтбора = Новый Структура("Идентификатор", Идентификатор);
		Выборка = РегистрыСведений.ПроизошедшиеБизнесСобытия.Выбрать(,,СтруктураОтбора);
		ЧислоЗаписей = 0;
		Пока Выборка.Следующий() Цикл
			
			ЗаписьУжеЕстьВБазе = Истина;
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			
			ЧислоЗаписей = ЧислоЗаписей + 1;
			Если ЧислоЗаписей >= 2 Тогда
				ЗаписьУжеЕстьВБазе = Ложь;
				НаборЗаписей.Очистить();
				Прервать;
			КонецЕсли;	
			
		КонецЦикла;	
		
		Если Обработано <> Неопределено Тогда
			НоваяЗапись.Обработано = Обработано;
		КонецЕсли;	
		
		Если ЧислоПопытокОбработки <> Неопределено Тогда
			НоваяЗапись.ЧислоПопытокОбработки = ЧислоПопытокОбработки;
		КонецЕсли;	
		
		Если ПометкаУдаления <> Неопределено Тогда
			НоваяЗапись.ПометкаУдаления = ПометкаУдаления;
		КонецЕсли;	
		
		Если СообщениеОбОшибке <> "" Тогда 
			НоваяЗапись.ра_Комментарий = НоваяЗапись.ра_Комментарий + Символы.ПС + СообщениеОбОшибке;
		КонецЕсли;	
		
		НаборЗаписей.Записать(); // записываем, стирая старые записи с отбором по Идентификатор
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры
